# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [2]:
data_url = 'https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv'

df= pd.read_csv(data_url)

df.head()

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

### Step 4. See the first 10 entries

In [3]:
df.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [6]:
del df['Unnamed: 0']
del df['Id']

df.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

### Step 6. Is there more male or female names in the dataset?

In [15]:
df['Gender'].value_counts()

Gender
F    558846
M    457549
Name: count, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [22]:
names = df.groupby('Name').sum()
names.sort_values('Count', ascending= 0)

,Year,Gender,State,Count
Name,,,,
Jacob,1141099,MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM...,AKAKAKAKAKAKAKAKAKAKAKALALALALALALALALALALALAR...,242874
Emma,1137085,FFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF...,AKAKAKAKAKAKAKAKAKAKAKALALALALALALALALALALALAR...,214852
Michael,1161152,MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMFF...,AKAKAKAKAKAKAKAKAKAKAKALALALALALALALALALALALAR...,214405
Ethan,1139091,MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM...,AKAKAKAKAKAKAKAKAKAKAKALALALALALALALALALALALAR...,209277
Isabella,1137090,FFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF...,AKAKAKAKAKAKAKAKAKAKAKALALALALALALALALALALALAR...,204798
...,...,...,...,...
Eniola,2012,F,TX,5
Atlantis,2005,F,TX,5
Marci,2004,F,TX,5
Simarpreet,2011,F,CA,5
Nita,2007,F,CA,5

### Step 8. How many different names exist in the dataset?

In [23]:
df['Name'].nunique()

17632

### Step 9. What is the name with most occurrences?

In [27]:
names['Count'].idxmax()

'Jacob'

### Step 10. How many different names have the least occurrences?

In [33]:
len(names[names['Count'] == names['Count'].min()])

2578

### Step 11. What is the median name occurrence?

In [36]:
names[names['Count'] == names['Count'].median()]

          Year    Gender             State  Count
Name
Aishani  14078   FFFFFFF    CACACACACAILNJ     49
Alara    16079  FFFFFFFF  CACACAFLNYNYNYTX     49
Alysse   16057  FFFFFFFF  CACACAMINYTXTXTX     49
Ameir    16086  MMMMMMMM  CAMIMIMIMIMINYOH     49
Anely    16071  FFFFFFFF  CACACACACACACACA     49
...        ...       ...               ...    ...
Sriram   14054   MMMMMMM    CACACACACACATX     49
Trinton  16069  MMMMMMMM  FLLAOKTXTXTXTXTX     49
Vita     14075   FFFFFFF    CACACACACANYNY     49
Yoni     16060  MMMMMMMM  CACACACACACAFLFL     49
Zuleima  14050   FFFFFFF    AZCACACACACACA     49

[66 rows x 4 columns]

### Step 12. What is the standard deviation of names?

In [38]:
names['Count'].std()

11006.06946789057

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [39]:
names['Count'].describe()

count     17632.000000
mean       2008.932169
std       11006.069468
min           5.000000
25%          11.000000
50%          49.000000
75%         337.000000
max      242874.000000
Name: Count, dtype: float64